[
   {
     "title": "Artichoke Croustades",
    "directions": "['Roll each bread slice flat with a rolling pin and trim it to form a 2 1/2-inch square. Brush both sides of the squares lightly with the butter and fit the squares gently into 1/8-cup muffin tins (gem tins), pressing the bread against the sides of the tins. Bake the croustades in the middle of a preheated 350* F. oven for 12 to 14 minutes, or until the edges are pale golden. The croustades may be made 2 days in advance and kept in an airtight container.', 'In a bowl stir together the artichoke hearts, the mayonnaise, 1 tablespoon of the scallion, 1/4 cup of the Parmesan, and salt and pepper to taste, divide the mixture by heaping teaspoons among the croustades, and sprinkle the remaining tablespoons Parmesan on top. Broil the croustades under a preheated broiler about 6 inches from the heat, being careful not to let the croustades edges burn, for 1 minute, or until the filling is bubbling. Garnish the croustades with the scallion greens and arrange 3 of them on each of 6 heated small plates.']",
    "ingredients": "['18 slices of very soft white bread, the crusts removed and reserved for another use', '3 tablespoons unsalted butter, melted', '1/2 cup finely chopped drained marinated artichoke hearts (a 6-ounce jar)', '3 tablespoons mayonnaise', '1 tablespoon finely chopped scallion plus finely chopped scallion greens for garnish', '1/4 cup plus 1 tablespoon freshly grated Parmesan']",
    "calories": 375,
    "category": "V"

  },
  {
    "title": "Scrambled Eggs with Avocado, Onion, and Cheddar",
    "directions": "['Chop onion. Halve, pit, and peel avocado and cut into 1/4-inch pieces. In a bowl whisk together eggs and Cheddar and season with salt and pepper. In a nonstick skillet heat butter over moderately high heat until foam subsides and saute onion, stirring, until just beginning to soften, about 2 minutes. Add egg mixture and cook, stirring constantly, until eggs are just set, about 1 minute. Remove skillet from heat and stir in avocado.', 'Serve eggs garnished with cilantro.']",
    "ingredients": "['1 small onion', '1/2 firm-ripe California avocado', '4 large eggs', '2/3 cup grated extra-sharp Cheddar (about 2 ounces)', '2 teaspoons unsalted butter', 'Garnish: chopped fresh cilantro sprigs']",
    "calories": 390,
    "category": "V"
  },
  {
    "title":"Nectarine and Blueberry Clafouti",
    "directions": "['Preheat oven to 325*F. and butter a 2-quart shallow baking dish.', 'Cut nectarines into 1/4-inch-thick wedges and in a bowl macerate with blueberries in wine 15 minutes.', 'Melt butter and cool slightly. In a large bowl whisk together eggs, granulated sugar, and salt. Whisk in flour until combined well and whisk in milk, butter, vanilla, and 1/4 cup wine from fruit mixture until smooth. With a slotted spoon transfer fruit to baking dish, reserving wine for another use (such as sangr*a), and arrange in bottom. Carefully pour batter over fruit (the fruit will rise to the top) and bake in upper third of oven until puffed and set in center, 55 to 60 minutes. Transfer clafouti to a rack to cool.', \"Just before serving, dust clafouti with confectioners'sugar. Serve clafouti warm or at room temperature.\"]",
    "ingredients": "['2 nectarines (about 1/2 pound)', '1 cup blueberries (about 5 ounces)', '1 cup fruity white wine such as Riesling', '5 tablespoons unsalted butter', '4 large eggs', '1/2 cup granulated sugar', '1/8 teaspoon salt', '1/2 cup all-purpose flour', '1 cup whole milk', '1 tablespoon vanilla', \"confectioners'sugar for dusting\"]",
    "calories": 328,
    "category": "D"
  },
  {
    "title": "Spaghetti with Asparagus, Shiitake Mushrooms, Lemon, and Chives",
    "directions": "['Cook spaghetti in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain. Transfer pasta to large wide bowl.', 'Meanwhile, melt 2 tablespoons butter with oil in heavy large skillet over medium heat. Add shallots; saute 1 minute. Add shiitake mushrooms; sprinkle with salt and pepper. Saute shiitake mixture until soft, about 6 minutes. Add lemon juice; cook 1 minute. Add broth and lemon peel. Bring to boil, then reduce to medium and simmer until liquid is reduced by half, about 6 minutes. Add asparagus to mushroom mixture; simmer until asparagus turns bright green, about 2 minutes. Add chives and remaining 2 tablespoons butter and stir until butter melts. Season sauce to taste with salt and pepper.', 'Pour sauce over pasta; toss to coat. Top with shaved Asiago and serve.', '*Available at some supermarkets, and at Italian markets and specialty food stores.']",
    "ingredients": "['12 ounces spaghetti', '4 tablespoons butter, divided', '2 tablespoons extra-virgin olive oil', '1/2 cup thinly sliced shallots (about 4)', '1 pound fresh shiitake mushrooms, stemmed, sliced', '6 tablespoons fresh lemon juice', '1 3/4 cups vegetable broth', '1 tablespoon grated lemon peel', '1 pound asparagus, tough ends trimmed, cut crosswise in thirds', '1/4 cup chopped fresh chives', '4 ounces shaved Asiago cheese*']",
    "calories": 671,
    "category": "V"
  },
  {
    "title": "Summer Strawberry Jam",
    "directions": "['Bring first 3 ingredients to boil in large saucepan over medium-high heat, stirring until sugar dissolves and brushing down sides of pan with wet pastry brush. Attach candy thermometer to sides of pan and boil syrup until thermometer registers 225*F, about 6 minutes. Mix in strawberries. Return mixture to boil, reduce heat, and simmer until jam thickens and thermometer registers 216*F, stirring occasionally, about 1 hour. Transfer jam to small bowl and cool. Cover and refrigerate.']",
    "ingredients": "['1 1/2 cups sugar', '1/2 cup water', '1 tablespoon fresh lemon juice', '8 cups halved hulled strawberries (about 5 pounds)']",
    "calories": 315,
    "category": "D"
  },
  {
    "title": "Spaghetti with Anchovy Olive Sauce",
    "directions": "['In a large heavy skillet (measuring at least 12 inches across top) cook garlic in oil over moderate heat, stirring, until pale golden. Add anchovies and cook, mashing them, until they dissolve into oil, about 1 minute. Stir in olives and parsley and remove skillet from heat.', 'In a kettle of salted boiling water cook spaghetti until al dente. Reserve 1 cup pasta cooking liquid and drain spaghetti in a colander. Add spaghetti and 1/2 cup reserved liquid to sauce. Heat pasta over moderate heat, stirring and tossing it and adding more reserved liquid as necessary, until it is coated well with sauce.']",
    "ingredients": "['5 large garlic cloves, sliced thin', '1/3 cup olive oil', 'a 2-ounce can flat anchovies, drained, patted dry, and chopped', '3/4 cup pimiento-stuffed olives, rinsed, drained well, and chopped fine', '1 cup finely chopped flat-leaf parsley leaves', '1 pound spaghetti']",
    "calories": 648,
    "category": "V"
  },
  {
    "title": "Small Pear and Almond Cakes",
    "directions": "['Peel pears, leaving stems intact, then core from bottom with melon-ball cutter. Toss pears with lemon juice in a bowl as peeled, then arrange on their sides in a 10-inch heavy skillet. Add wine, butter, and lemon juice from bowl (liquid will not cover pears) and bring to a boil. Reduce heat and simmer, covered, until pears are just tender, 10 to 20 minutes. Transfer pears with a slotted spoon to a dish. Boil poaching liquid, uncovered, until just syrupy and reduced to about 1/4 cup, 12 to 15 minutes. Spoon syrup over pears and cool to room temperature, stirring occasionally, about 10 minutes.', 'Put oven rack in middle position and preheat oven to 400*F.', 'Pulse almonds with 1/2 cup sugar in a food processor until finely ground, then transfer to a bowl (do not clean processor).', 'Process butter with 1/2 cup sugar in processor until pale and creamy, then pulse in vanilla. Add eggs 1 at a time, blending well after each addition, then pulse in almond mixture, flour, and salt until just combined.', 'Lightly butter and flour ramekins, knocking out excess flour, then arrange in a baking pan. Divide batter among ramekins (about a slightly rounded 1/2 cup per ramekin), then gently nestle a pear, leaning it slightly and pressing it very lightly, into batter in center of each cake. (Cakes will rise around pears as they bake.) Reserve reduced poaching liquid for another use. Sprinkle pears and tops of cakes with remaining tablespoon sugar.', 'Bake, rotating pan halfway through baking, until cakes are just firm and pale golden with slightly darker edges, about 20 minutes.', 'Transfer ramekins to a rack and cool 10 minutes, then run a thin knife around edge of each cake and invert onto a plate. Turn cakes right side up and serve warm or at room temperature.']",
    "ingredients": "['12 firm small Seckel pears (2 to 3 inches long)', '1 tablespoon fresh lemon juice', '2 cups Essencia or other Muscat wine', '1/2 tablespoon unsalted butter', '1 1/2 cups whole blanched almonds (1/2 lb)', '1 cup plus 1 tablespoon sugar', '2 sticks (1 cup) unsalted butter, softened, plus additional for greasing ramekins', '1 teaspoon pure vanilla extract', '4 large eggs', '2/3 cup all-purpose flour plus additional for dusting', '3/8 teaspoon salt', 'Special equipment: a small melon-ball cutter; 12 (4-oz) ramekins or 2 muffin pans with 6 large (1-cup) muffin cups']",
    "calories": 562,
    "category": "V"
  },
  {
    "title": "Sherried Chicken Wings with Mushrooms and Peas",
    "directions": "['Cut off the wing tips, reserving them for another use such as stock if desired, and halve the wings at the joint. In a shallow bowl dredge the wings in the flour, shaking off the excess. In a heavy skillet large enough to hold the wings in one layer without crowding heat the oil and the butter over moderately high heat until the fat is hot but not smoking and in it brown the wings. With a slotted spoon transfer the wings to a plate. In the fat remaining in the skillet cook the onion and the garlic over moderate heat, stirring, until the onion is softened. Add the mushrooms and the thyme and cook the mixture, stirring, until the mushrooms are tender. Add the Sherry and boil the mixture until the liquid is reduced by half. Add the broth, the juice, and salt and pepper to taste, return the wings to the skillet, and simmer the mixture, covered partially, for 20 minutes. Stir in the peas and simmer the mixture, covered, for 5 minutes, or until the peas are tender. Serve the wings and the sauce with the noodles.']",
    "ingredients": "['2 pounds chicken wings (about 10)', 'all-purpose flour seasoned with salt and pepper for dredging the wings', '2 tablespoons vegetable oil', '2 tablespoons unsalted butter', '1 large onion, halved lengthwise and sliced thin lengthwise', '1 large garlic clove, minced', '8 to 10 ounces mushrooms, sliced thin', '1/2 teaspoon dried thyme, crumbled', '1/2 cup medium-dry Sherry', '1 cup chicken broth', '1 teaspoon fresh lemon juice, or to taste', 'a 10-ounce package frozen peas', 'cooked noodles as an accompaniment']",
    "calories": 653,
    "category": "P"
  },
  {
    "title": "Braised Rabbit with Grainy Mustard Sauce",
    "directions": "['Rinse rabbit pieces and remove any fat, then pat dry and divide into 3 batches. Mix together salt and pepper in a small bowl for seasoning rabbit.', 'Put oven rack in middle position and preheat oven to 350*F.', 'Heat a dry 12-inch heavy skillet over moderately high heat until hot. Season first batch of rabbit, then add 3 tablespoons oil to skillet and brown rabbit on all sides, about 5 minutes total. Transfer browned rabbit to a flameproof roasting pan just large enough to hold all 3 batches in 1 layer. Season and brown remaining 2 batches of rabbit in same manner, transferring to roasting pan and adding more oil to skillet between batches if necessary. Reserve skillet.', 'Add broth to roasting pan, then cover pan tightly with foil and braise rabbit in oven 15 minutes.', 'While rabbit is braising, pour off any fat from skillet, then add onions, garlic, thyme, and 3 tablespoons butter and cook over moderately low heat, stirring and scraping up any brown bits, until onions are softened, about 5 minutes. Add wine and boil until liquid is reduced by half, about 10 minutes.', 'Pour mixture over rabbit and continue to braise, covered tightly, until rabbit is tender when pierced with a fork, 45 minutes to 1 hour more. Transfer rabbit to an ovenproof serving dish and keep warm, covered loosely with foil, in turned-off oven.', 'Straddle roasting pan over 2 burners and boil braising liquid until reduced to about 3 1/4 cups, about 10 minutes. Transfer 1/2 cup reduced liquid to a bowl and whisk in mustards. Add mustard mixture to reduced liquid in pan, whisking to incorporate. Dissolve cornstarch in water and whisk into sauce, then simmer, whisking, 2 minutes. Add remaining 3 tablespoons butter to sauce and swirl pan until incorporated. Season sauce with salt and pepper and pour over rabbit.', '*Available at butcher shops, specialty foods shops, and some supermarkets (may require special order).']",
    "ingredients": "['2 (3-pound) rabbits*, each cut into 6 serving pieces', '1 1/2 teaspoons salt', '1 teaspoon black pepper', '3 to 4 tablespoons vegetable oil', '1 3/4 cups reduced-sodium chicken broth (14 fluid ounces', '2 medium onions, finely chopped (2 cups)', '3 large garlic cloves, finely chopped', '1 teaspoon chopped fresh thyme', '3/4 stick (6 tablespoons) cold unsalted butter, cut into tablespoon pieces', '2 1/2 cups dry white wine', '1/3 cup Dijon mustard', '1/4 cup whole-grain mustard', '2 teaspoons cornstarch', '2 tablespoons cold water', 'Garnish: fresh thyme sprigs']",
    "calories": 662,
    "category": "P"
  },
  {
    "title": "Gingerbread with Vanilla Ice Cream and Exotic Caramel Sauce",
    "directions": "['Preheat oven to 375*F. Lightly butter 13 x 9 x 2-inch baking pan. Sift 2 1/2 cups flour, ground ginger, cinnamon and salt into medium bowl. Mix crystallized ginger with 2 teaspoons flour in small bowl.', 'Using electric mixer, beat butter in large bowl until fluffy. Add brown sugar and beat until mixture is light and fluffy. Mix molasses, 1 cup boiling water and baking soda in another medium bowl to blend. Stir into butter mixture. Stir in dry ingredients, then egg and crystallized ginger mixture. Pour batter into prepared pan.', 'Bake cake 15 minutes. Reduce oven temperature to 350*F and bake cake until tester inserted into center comes out clean, about 12 minutes longer. Transfer pan to rack; cool 30 minutes. Turn cake out onto rack; cool. (Can be made 8 hours ahead. Cover; store at room temperature.)', 'Cut gingerbread into pieces. Transfer gingerbread to plates. Top each piece with ice cream. Spoon Exotic Caramel Sauce over and serve.']",
    "ingredients": "['2 1/2 cups plus 2 teaspoons all purpose flour', '2 1/2 teaspoons ground ginger', '1 teaspoon ground cinnamon', '1 teaspoon salt', '3/4 cup chopped crystallized ginger (about 5 ounces)', '1/2 cup (1 stick) unsalted butter, room temperature', '1/2 cup (packed) golden brown sugar', '1 cup mild-flavored (light) molasses', '1 cup boiling water', '2 teaspoons baking soda', '1 large egg, beaten to blend', 'Vanilla ice cream', 'Exotic Caramel Sauce']",
    "calories": 443,
    "category": "D"
  },
  {
    "title": "Broiled Cod With Fennel and Orange",
    "directions": "['Heat broiler to high. Mix mayonnaise, red pepper flakes, 1 tsp. garlic, 1 tsp. orange zest, and 1/2 tsp. salt in a small bowl.', 'Arrange cod fillets on a rimmed baking sheet. Spread mayonnaise mixture over each fillet.', 'Toss fennel, broccolini, orange, beans, oil, rosemary, and remaining garlic, 1 tsp. orange zest, and 1/2 tsp. salt in a large bowl. Arrange around fish on baking sheet, placing orange slices on top of beans and vegetables.', 'Place baking sheet under broiler and broil until fish is golden-brown on top, about 5 minutes. Remove from oven, top each fillet with almonds, then continue to broil until almonds are toasted and crisp and fish is completely cooked through, about 1 minute more.']",
    "ingredients": "['1/4 cup mayonnaise', '1/4 teaspoon crushed red pepper flakes (optional)', '2 garlic cloves, finely grated, divided', '2 teaspoons finely grated orange zest, divided', '1 teaspoon kosher salt, divided', '4 (6-ounce) skinless cod fillets', '1 fennel bulb, very thinly sliced (about 12 ounces)', '1 bunch broccolini, trimmed, halved (about 8 ounces)', '1 small orange, preferably blood, thinly sliced', '1 (15.5-ounce) can white beans, drained, rinsed', '2 tablespoons olive oil', '1 tablespoon rosemary leaves', '1/4 cup sliced almonds, chopped (about 1 ounce)']",
    "calories": 476,
    "category": "P"
  },
  {
    "title":"Indian-Style Chicken with Ginger and Curry",
    "directions": "['Mix first 6 ingredients in 8 x 8 x 2-inch glass baking dish. Add chicken; turn to coat with marinade. Cover and refrigerate at least 2 hours and up to 1 day.', 'Remove chicken from marinade and reserve marinade. Pat chicken dry and sprinkle with salt and pepper. Heat olive oil in heavy large skillet over medium-high heat. Add chicken to skillet and saute until brown, about 3 minutes per side. Add reserved marinade and chicken broth and bring to boil. Reduce heat to medium-low and simmer uncovered until chicken is cooked through, turning occasionally, about 6 minutes. Transfer chicken and sauce to platter. Serve with yogurt, if desired.']",
    "ingredients": "['1 cup chopped onion', '1/4 cup bottled nonfat Italian dressing', '1 tablespoon chopped peeled fresh ginger', '3/4 teaspoon dried crushed red pepper', '1/2 teaspoon curry powder', '1/4 teaspoon ground turmeric', '4 skinless boneless chicken breast halves', '1 tablespoon olive oil', '1/2 cup canned low-salt chicken broth', 'Plain nonfat yogurt (optional)']",
    "calories": 376,
    "category": "P"
  },
  {
    "title": "Classic Apple Pie",
    "directions": "['In a small bowl, whisk together flour and sugar. Set aside.', 'In a small bowl, mix milk and cream. Chill until needed.', 'Place the apples in a medium bowl. Add the lemon juice and toss with a spatula until the apples are well coated.', 'Place the granulated sugar, brown sugar, tapioca starch, cornstarch, Chinese five-spice powder, and salt in a small bowl and whisk to combine. Pour the dry ingredients into the bowl of apples and mix until the apples are again well coated. Set aside to macerate for at least 25 minutes.', 'Place a colander over a medium bowl and transfer the macerated apples to the colander, making sure to scrape down the side of the bowl to get all the juices, sugars, and starches. Let the apples drain for 25 minutes.', 'Pour the drained juice into a small saucepan, scraping down the side and bottom of the bowl to get every drop. Bring the apple juice to a boil over medium-high heat, stirring constantly. Reduce heat and continue to boil the apple juice gently until it thickens, about 2 minutes. Remove from the heat and set aside to cool. Once it is room temperature, chill the saucepan in the refrigerator for about 20 minutes.', \"Sprinkle Crust Dust into the empty pie shell. Pour in the apples, making sure to scrape out any dry ingredients or juices that stick to the side of the bowl. Make a well in the middle of the apples and pour in the thickened apple juice. Gently smooth the pie filling with a spatula and dot with the butter. Finish the pie with the second crust, following Epi's double-crust pie instructions, then freeze for at least 20 minutes.\", 'Preheat the oven to 400*F (200*C).', 'Brush the top of pie with Pie Wash and bake for 45 minutes to 1 hour, rotating 180 degrees every 20 minutes, until the crust is dark golden brown and the juices are bubbling thickly through the vents. Cool for at least 2 hours before slicing.']",
    "ingredients": "['1/2 teaspoon all-purpose flour', '1/2 teaspoon sugar', '1 tablespoon whole milk', '1 tablespoon heavy cream', '1 double-crust All-Butter Pie Dough shell', '8 cups (960 grams) apples, peeled and chopped into bite-sized pieces (roughly 1 inch long by 3/4-inch thick [2.5cm by 19mm])', '1 tablespoon (16 grams) lemon juice', '3/4 cup (150 grams) granulated sugar', '3 tablespoons (45 grams) dark brown sugar', '1 tablespoon plus 1 teaspoon (10 grams) tapioca starch', '1 tablespoon (9 grams) cornstarch', '1 teaspoon (2 grams) Chinese five-spice powder', '1/2 teaspoon (1.5 grams) kosher salt', '1 tablespoon (14 grams) unsalted butter, cut into small pieces']",
    "calories": 318,
    "category": "D"
  },
  {
    "title": "Creamed Oysters and Mushrooms on Toast",
    "directions": "['Cut mushrooms into 1/4-inch-thick slices and finely chop shallot. In a 2-quart saucepan cook mushrooms and shallot with salt to taste in butter over moderate heat, stirring occasionally, until liquid mushrooms give off is evaporated and they are golden. Add wine and bring to a boil. In a measuring cup vigorously stir together milk and flour and add to mushroom mixture with cream and cayenne. Simmer cream mixture, stirring occasionally, until mixture is slightly thickened, about 3 minutes.', 'Toast bread. Add oysters and parsley to cream mixture, stirring gently, and cook at a bare simmer until edges of oysters curl, about 3 minutes. Arrange toast on 2 plates and spoon creamed oysters and mushrooms on top.']",
    "ingredients": "['1/4 pound mushrooms', '1 large shallot', '1 tablespoon unsalted butter', '2 tablespoons dry white wine', '3/4 cup whole milk', '1 tablespoon all-purpose flour', '1/2 cup heavy cream', 'a pinch cayenne', 'two 3/4-inch-thick slices bread (preferably brioche)', '12 shucked oysters (preferably Belon)', '2 teaspoons chopped fresh parsley leaves']",
    "calories": 629,
    "category": "V"
  },
  {
    "title": "Sauteed Mushrooms with Melted Stilton",
    "directions": "['Preheat oven to 425*F.', 'Trim mushrooms and halve if small or quarter if large. Crumble enough Stilton, not including rind, to measure about 1 cup. Force garlic through a garlic press.', 'In a 9-inch heavy skillet heat butter over moderately high heat until foam subsides and saute mushrooms, stirring, until golden, about 2 minutes. Stir in garlic and cream and gently boil until slightly thickened, about 4 minutes. Season mixture with salt and pepper and divide between 2 shallow 1-cup gratin dishes. Mushroom mixture may be made 1 day ahead and chilled, covered.', 'Top mushroom mixture with Stilton and on a baking sheet bake in middle of oven until cheese is melted and bubbling, 5 to 10 minutes.', 'Serve mushrooms with bread for sopping up sauce.']",
    "ingredients": "['1/2 pound mushrooms', '1/2 pound Stilton cheese', '2 large garlic cloves', '1 tablespoon unsalted butter', '1/3 cup heavy cream', 'Accompaniment: chunks of crusty whole-grain bread']",
    "calories": 551,
    "category": "V"
  },
  {
    "title": "Palm Springs Date Shake",
    "directions": "['Preheat oven to 350*F. Toast walnuts on a rimmed baking sheet, tossing once, until slightly darkened in color and fragrant, 8%u201310 minutes. Let cool.', 'Meanwhile, place dates in a small bowl and add 1/2 cup hot water to cover; soak 10 minutes to soften.', 'Blend walnuts, dates with their soaking liquid, cinnamon, and salt in a blender until a coarse paste forms. Add ice cream and 3/4 cup cracked ice and blend until smooth. Divide shake between 2 glasses.']",
    "ingredients": "['1/4 cup walnuts', '1/2 cup Deglet Noor or Medjool dates, pitted', 'Pinch of ground cinnamon', 'Pinch of kosher salt', '1 cup vanilla ice cream']",
    "calories": 316,
    "category": "D"
  },
  {
   "title": "Greek-Style Lamb and Eggplant Lasagne",
    "directions": "['Cut eggplant lengthwise into 1/3-inch-thick slices and sprinkle slices on both sides with salt. Arrange eggplant in a large colander and weight it with a heavy bowl. Drain eggplant 1 hour. Remove bowl and pat eggplant dry.', 'Set broiler rack so that eggplant will be about 4 inches from heat and preheat broiler.', 'Arrange eggplant in one layer in oiled shallow baking pans and brush with oil. Broil eggplant until golden, about 3 minutes on each side.', 'In a large heavy non-stick skillet cook onions and garlic in oil over moderate heat, stirring, until softened. Add lamb and cook, stirring to break up, until it is no longer pink, about 3 minutes. Stir in remaining meat sauce ingredients and salt and pepper to taste and simmer, uncovered, 30 minutes. Meat sauce may be made 3 days ahead, cooled completely, and chilled, covered.', 'In a heavy saucepan melt butter over moderately low heat and whisk in flour until smooth. Cook roux, whisking, 3 minutes. Whisk in milk in a stream and salt and pepper to taste and simmer, whisking occasionally, 5 minutes, or until thick. Whisk in egg, whisking vigorously, and simmer sauce, whisking, 1 minute. White sauce may be made 2 days ahead and chilled, its surface covered with plastic wrap.', 'Preheat oven to 375*F.', 'Pour 1 cup meat sauce into a flame-proof baking dish, 13 by 9 by 2 inches (sauce will not cover bottom completely), and cover with 3 lasagne sheets, making sure they do not touch each other. Spread about 1 1/2 cups meat sauce over pasta and arrange 1 layer broiled eggplant on top. Gently spread about 1/2 cup white sauce over eggplant and sprinkle with about 1/3 cup feta. Make 2 more layers in same manner, beginning and ending with pasta. Spread remaining white sauce evenly over top pasta layer, making sure pasta is completely covered, and sprinkle with remaining feta.', 'Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling.', 'Set broiler rack so that lasagne will be about 4 inches from heat and preheat broiler.', 'Broil lasagna 1 to 2 minutes, or until golden. Let lasagne stand 5 minutes before serving.']",
    "ingredients": "['2 pounds eggplant (about 2 medium)', 'olive oil for brushing', '2 large onions, chopped (about 2 cups)', '3 garlic cloves, minced', '2 tablespoons olive oil', '1 1/2 pounds ground lamb (preferably 10% fat)', 'a 28- to 32-ounce can whole tomatoes with juice', '2 tablespoons tomato paste', '1 teaspoon cinnamon', '1/8 teaspoon ground allspice', '1/2 stick (1/4 cup) unsalted butter', '5 tablespoons all-purpose flour', '4 cups milk', '1 large egg, lightly beaten', 'an 8-ounce package feta, crumbled (about 1 1/2 cups)', 'twelve 7- by 3 1/2-inch sheets dry no-boil lasagne pasta']",
    "calories": 639,
    "category": "P"
  },
  {
    "title": "Strawberry, Lime, and Champagne",
    "directions": "['In a small saucepan, combine the sugar with 1/2 cup water and simmer the mixture for 5 minutes, or until the sugar is dissolved. Let the sugar syrup cool completely. In a food processor, puree the strawberries with their syrup and the lime juice, transfer the mixture to a large punch bowl, forcing it through a fine sieve if desired, and stir in the sugar syrup, the brandy, and the club soda. Chill the mixture, covered, until it is cold. Add the champagne slowly just before serving and serve the punch in punch glasses, each garnished with a strawberry slice and a lime slice.']",
    "ingredients": "['1/3 cup sugar', '10-ounce package frozen strawberries in syrup, thawed', '1/2 cup fresh lime juice', '1/2 cup brandy', '1/2 chilled club soda', '2 bottles (25.4 ounces each) chilled champagne', 'Strawberries, sliced thin, for garnish if desired', 'Thin lime slices, halved, for garnish if desired']",
    "calories": 454,
    "category": "D"
  },
  {
    "title":  "Red Curry%u2013Marinated Japanese Eggplant",
    "directions": "['puree chiles, garlic, lemongrass, oil, ginger, cumin, sugar, and 1 tsp. salt in a blender or food processor until smooth. Score cut sides of eggplant in a cross-hatch pattern with the tip of a sharp knife. Coat each eggplant liberally with curry paste; set aside any remaining paste. Let eggplants sit at least 10 minutes and up to 1 hour.', 'Prepare a grill for medium-high heat. Lightly season eggplants with salt and grill, turning occasionally, until browned and tender, about 5 minutes per side. Serve with reserved curry paste.', 'Marinade can be made 3 days ahead. Cover and chill.']",
    "ingredients": "['6 Fresno chiles, seeds removed from 3, chopped', '4 garlic cloves', '2 lemongrass stalks, bottom third only, tough outer layers removed, finely grated', '1/3 cup vegetable oil', '1 tablespoon finely grated peeled ginger', '1 teaspoon ground cumin', '1/2 teaspoon sugar', '1 teaspoon kosher salt, plus more', '4 Japanese eggplants, halved lengthwise']",
    "calories": 309,
    "category": "V"
  },
  {
    "title": "Breakfast Couscous with Dried-fruit compote",
    "directions": "['Simmer water, sugar, and fruit in a small saucepan over medium heat, uncovered, stirring occasionally, until liquid just starts to become syrupy, about 8 minutes. Add tea bag and let steep off heat while making couscous.', 'Cook couscous in butter in a heavy medium saucepan over medium-high heat, stirring, until pale golden, about 2 minutes. Off heat, stir in water, cinnamon, and 1/8 teaspoon salt. Cover tightly. Let stand 5 minutes, then fluff.']",
    "ingredients": "['1 1/4 cups water', '3 tablespoons packed dark brown sugar', '1 1/2 cups mixed dried fruit such as apricots, cherries, cranberries, and apples, chopped if large', '1 tea bag of black tea such as orange pekoe or English breakfast', '1 to 3 teaspoons fresh lemon juice', '1 cup couscous', '3 tablespoons unsalted butter', '1 1/2 cups boiling water', '1/2 teaspoon cinnamon', 'Accompaniments: chopped toasted almonds; warm milk for drizzling']",
    "calories": 323,
    "category": "V"
  },
  {
    "title": "Pork Cutlets with Figs and Balsamic Vinegar",
    "directions": "['Preheat oven to 200*F. Sprinkle pork with salt and pepper. Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Add 4 pork slices and saute until brown, about 2 minutes per side. Transfer pork to baking sheet. Add remaining 1/2 tablespoon oil to skillet. Repeat with remaining 4 pork slices. Transfer pork to oven to keep warm.', 'Melt 1 tablespoon butter in same skillet over medium-high heat. Add shallots and saute until tender, about 2 minutes. Add 2 tablespoons vinegar. Simmer until vinegar evaporates, scraping up any browned bits on bottom of skillet, about 1 minute. Add chicken broth. Simmer until mixture is reduced by half, about 4 minutes. Add figs and whipping cream. Simmer until sauce thickens slightly, about 4 minutes. Add remaining 1 tablespoon vinegar and any accumulated juices from pork. Simmer until sauce thickens enough to coat spoon, about 2 minutes longer. Season sauce to taste with salt and pepper.', 'Arrange pork on plates. Spoon sauce over. Sprinkle with parsley and serve.']",
    "ingredients": "['8 1/3-inch-thick slices center-cut pork loin', '1 1/2 tablespoons olive oil', '1 tablespoon butter', '1/4 cup minced shallots', '3 tablespoons balsamic vinegar', '1 cup canned low-salt chicken broth', '6 fresh ripe figs, quartered', '1/2 cup whipping cream', '1 tablespoon minced parsley']",
    "calories": 314,
    "category": "P"
  },
  {
    "title": "Creamy Monkfish, Tomato, and Shellfish Potpie with Puff Pastry Crust",
    "directions": "['In a kettle cook the onion, the celery, and the garlic in the oil over moderately low heat, stirring, until the onion is softened, add the fennel seeds, the clam juice, the Tabasco, the mushrooms, the potatoes, peeled and cut into 3/4-inch pieces, the thyme, and the basil, and simmer the mixture for 15 minutes, or until the potatoes are barely tender. In a small bowl whisk together the cream and the cornstarch, whisk the mixture into the potato mixture, and boil the mixture, whisking, for 1 minute. Stir the monkfish, the scallops, the shrimp, the parsley, and salt and pepper to taste and transfer the mixture to a 3-quart oval baking dish.', 'On a floured surface roll out the puff pastry into an oval to fit the dish and brush the edge of the dish with water. Arrange the pastry over the edge of the dish and roll the rolling pin over the edge of the dish to cut the pastry. Bake the potpie in the middle of a preheated 425*F. oven for 17 to 20 minutes, or until the crust is puffed and golden brown. To serve, cut the crust into 8 pieces, arrange 1 piece on each of 8 heated dinner plates, and divide the filling among the plates.']",
    "ingredients": "['1 onion, minced', '1 rib of celery, sliced thin', '2 teaspoons minced garlic', '2 tablespoons olive oil', '1/2 teaspoon fennel seed', '1 cup bottled clam juice', 'a 14-ounce can tomatoes including the juice', 'a dash of Tabasco', '1/4 pound mushrooms, cut into eighths', '1 pound boiling potatoes', '1/2 teaspoon dried thyme, crumbled', '1/2 teaspoon crumbled dried basil', '1/2 cup heavy cream', '3 tablespoons cornstarch', '1 1/2 pounds monkfish fillets, cut into 1-inch pieces', '1/2 pound sea scallops, halved crosswise', '1/2 pound shrimp, shelled', '2 tablespoons finely chopped fresh parsley leaves', '1 sheet of frozen puff pastry, thawed']",
    "calories": 437,
    "category": "P"
  },
  {
    "title": "Carrot-Coconut Cupcakes with Cream Cheese Frosting",
    "directions": "['Preheat oven to 350*F. Line 12-cup muffin tin with muffin papers. Whisk sugar, oil, and eggs in large bowl to blend. Whisk flour, baking soda, cinnamon, salt, and nutmeg in medium bowl to blend. Stir pineapple, carrots, coconut, and pecans in another medium bowl to blend. Stir flour mixture into egg mixture until just blended. Fold in carrot mixture. Spoon batter into prepared muffin cups, dividing equally. Bake cupcakes until tops are golden brown and tester inserted into centers comes out clean, about 20 minutes. Remove cupcakes from pan and cool completely on rack.', 'Melt white chocolate in top of double boiler over barely simmering water until melted and smooth. Remove from over water. Using on/off turns, blend cream cheese, butter, lemon peel, and melted white chocolate in processor until smooth. Add powdered sugar; process until smooth. Spread frosting on cupcakes. (Can be made 1 day ahead. Cover and refrigerate.)']",
    "ingredients": "['1 cup sugar', '1/2 cup vegetable oil', '2 large eggs', '1 cup all purpose flour', '1 teaspoon baking soda', '1 teaspoon ground cinnamon', '1/2 teaspoon salt', '1/4 teaspoon ground nutmeg', '2 8-ounce cans crushed pineapple in juice, drained', '1 cup grated peeled carrots', '3/4 cup (lightly packed) sweetened flaked coconut', '1/4 cup chopped pecans', '1 1/2 ounces imported white chocolate, chopped (about 1/4 cup)', '1 8-ounce package cream cheese, room temperature', '1/4 cup (1/2 stick) unsalted butter, room temperature', '1 teaspoon grated lemon peel', '1 cup powdered sugar']",
    "calories": 426,
    "category": "D"
  },
  {
    "title": "Halibut with Sambal Vinaigrette and Wasabi Cream",
    "directions": "['Preheat oven to 400*F.', 'Blend vinaigrette ingredients in a blender until smooth. Season with salt.', 'Whisk together wasabi powder and water until smooth, then whisk in sour cream. Season with salt.', 'Pat fish dry and season with salt and pepper. Sprinkle 1 side of each piece with parsley.', 'Heat a well-seasoned cast-iron skillet over high heat until hot. Add oil, then fish, parsleyed sides up. Sear fish until undersides are browned, about 1 minute.', 'Turn fish over and put skillet in middle of oven. Roast until just cooked through, 4 to 5 minutes.', 'Serve fish, parsleyed sides up, with a spoonful of each sauce.']",
    "ingredients": "['1 1/2 tablespoons rice vinegar (not seasoned)', '2 teaspoons sambal oelek (Southeast Asian chile sauce)', '1 1/2 teaspoons Dijon mustard', '1/3 cup vegetable oil', '2 teaspoons wasabi (green horseradish) powder', '3 tablespoons water', '1/4 cup sour cream', '1 (2-lb) halibut steak (1 1/2 inches thick), skinned, boned, and cut into 4 pieces', '1/4 cup finely chopped fresh parsley', '1/2 tablespoon vegetable oil', 'Accompaniment: pickled ginger']",
    "calories": 417,
    "category": "P"
  },
  {
    "title": "Linguine Avgolemono with Artichoke Hearts and Green Beans",
    "directions": "['Place yolks in medium bowl. Gradually whisk in lemon juice, then cream.', 'Cook artichoke hearts and green beans in large pot of boiling salted water until crisp-tender, about 5 minutes. Using sieve, transfer vegetables from pot to large skillet. Return water to boil. Add pasta; boil until tender but still firm to bite. Drain pasta, reserving 1 1/2 cups cooking liquid.', 'Add pasta to skillet with vegetables. Whisk 3/4 cup cooking liquid into yolk mixture. Add yolk mixture, 3/4 cup cheese, and parsley to skillet. Toss over medium heat just until sauce thickens and coats pasta, about 4 minutes, adding more cooking liquid by tablespoonfuls if dry. Season with salt and pepper. Serve, passing additional cheese alongside.']",
    "ingredients": "['3 large egg yolks', '1/4 cup fresh lemon juice', '1/2 cup whipping cream', '12 ounces frozen artichoke hearts', '8 ounces green beans, trimmed, cut on diagonal into 2-inch-long pieces', '12 ounces linguine', '3/4 cup freshly grated Parmesan cheese plus additional for serving', '1/4 cup chopped fresh Italian parsley']",
    "calories": 546,
    "category": "V"
  },
  {
    "title": "Banana Cake with Sour Cream Frosting",
    "directions": "['Preheat oven to 350*F. Lightly butter and flour 13 x 9 x 2-inch metal baking pan. In medium bowl, combine flour, baking soda, baking powder and salt. Using electric mixer, beat butter and 1 1/2 cups sugar in large bowl until blended. Add eggs and beat until fluffy. Mix in 3/4 cup sour cream, bananas and lemon juice. Add dry ingredients to banana mixture and beat until well blended. Transfer batter to prepared pan.', 'Bake cake until top is golden and tester inserted into center comes out clean, about 30 minutes. Cool completely on rack. (Can be prepared 2 weeks ahead. Cover cake and freeze. Thaw before continuing.)', 'Beat remaining 1/2 cup sour cream, powdered sugar and cream cheese in large bowl until well blended. Spread frosting over cooled cake.']",
    "ingredients": "['2 cups all purpose flour', '3/4 teaspoon baking soda', '1/2 teaspoon baking powder', '1/2 teaspoon salt', '1/2 cup (1 stick) unsalted butter, room temperature', '1 1/2 cups sugar', '2 large eggs', '1 1/4 cups sour cream', '1 1/3 cups mashed ripe bananas (about 3 large)', '2 tablespoons fresh lemon juice', '2/3 cup powdered sugar', '1 8-ounce package cream cheese, room temperature']",
    "calories": 485,
    "category": "D"
  },
  {
    "title": "Country Bread Stuffing with Smoked Ham, Goat Cheese, and Dried Cherries",
    "directions": "['Preheat oven to 375*F. Place cherries in bowl; cover with boiling water. Let stand until soft, about 15 minutes. Drain.', 'Cut bottom crust and short ends off bread; discard. Cut remaining bread with crust into 1-inch cubes (10 cups loosely packed). Place in large bowl. Add oil, thyme, and garlic; toss. Spread out on large rimmed baking sheet. Sprinkle with salt and pepper. Bake until golden and slightly crunchy, stirring often, about 20 minutes. Return to same large bowl.', 'Melt butter in large skillet over medium-high heat. Add next 4 ingredients. saute until vegetables are soft, about 10 minutes. Mix in parsley and cherries. DO AHEAD Bread cubes and vegetable mixture can be made 1 day ahead. Cover separately. Store bread at room temperature. Chill vegetables.', 'Preheat oven to 375*F. Butter 11x7x2-inch glass baking dish. Stir vegetables and nuts into bread cubes. Add hot broth, tossing to coat. Mix in cheese. Transfer to dish. Cover with buttered foil, buttered side down. Bake until heated through, about 25 minutes. Uncover and bake until top is brown, about 25 minutes longer, and serve.']",
    "ingredients": "['1/2 cup dried tart cherries', '1 (1-pound) loaf crusty country-style white bread', '1/4 cup olive oil', '4 teaspoons chopped fresh thyme', '1 large garlic clove, minced', '6 tablespoons (3/4 stick) butter', '1 1/2 cups finely chopped onion', '1 1/2 cups thinly sliced celery', '1 1/4 cups chopped smoked ham (preferably from 2 meaty ham hocks)', '1 cup finely chopped green bell pepper', '1/3 cup chopped fresh parsley', '1/2 cup toasted husked hazelnuts, coarsely chopped', '1 3/4 cups low-salt chicken broth or turkey stock, heated', '4 ounces chilled fresh goat cheese, crumbled into 1/2-inch pieces']",
    "calories": 425,
    "category": "P"
  },
  {
    "title": "Roasted-Garlic Beef Stew",
    "directions": "['Preheat oven to 350*F. Toss garlic with 1 tablespoon melted butter on small baking sheet. Bake until garlic is tender and beginning to brown, about 15 minutes. Cool garlic 5 minutes. Peel and set aside.', 'Melt 3 tablespoons butter in large pot over high heat. Sprinkle beef with salt and pepper; dust with 1 tablespoon flour. Add beef to pot. saute until no longer pink, about 6 minutes. Transfer beef to bowl. Add vegetables, broth, wine, herbs and roasted garlic to pot. Bring to boil. Reduce heat to medium-low. Cover; simmer until vegetables are tender, about 25 minutes.', 'Return beef and any juices to pot. Mix remaining 1 tablespoon butter and 1 tablespoon flour in small bowl. Whisk flour paste into stew. Simmer uncovered until sauce thickens, about 2 minutes. Season with salt and pepper and serve.']",
    "ingredients": "['12 large garlic cloves, unpeeled', '1 tablespoon butter, melted', '4 tablespoons (1/2 stick) butter', '1 pound beef tenderloin, cut into 1-inch pieces', '2 tablespoons all purpose flour', '2 large parsnips, peeled, chopped', '2 carrots, peeled, chopped', '1 large potato, peeled, chopped', '1 rutabaga, peeled, chopped', '1 14 1/2-ounce can beef broth', '1 cup dry red wine', '1 tablespoon dried thyme, crumbled', '2 teaspoons dried rubbed sage']",
    "calories": 658,
    "category": "P"
  },
  {
    "title":"Scalloped Squash, Red Pepper, and Corn Gratin with Cheddar Crust",
    "directions": "['Melt butter in heavy medium skillet over medium heat. Add flour and whisk 1 minute. Whisk in hot milk; whisk until mixture boils, thickens, and is smooth, about 5 minutes. Remove from heat. Add cheese and hot pepper sauce and whisk until cheese melts. Season sauce to taste with salt and pepper.', 'Butter 11x7x2-inch glass baking dish. Heat 1/2 tablespoon oil in large nonstick skillet over medium-high heat. Add half of yellow squash and half of zucchini; saute until crisp-tender, about 4 minutes. Transfer squash-zucchini mixture to large bowl. Repeat with 1/2 tablespoon oil and remaining yellow squash and zucchini.', 'Heat remaining 1 tablespoon oil in same skillet over medium-high heat. Add onion, bell pepper, and garlic; saute until onion is golden and pepper is tender, about 7 minutes. Stir in corn and rosemary. Transfer to bowl with squash-zucchini mixture. Mix in cheese sauce. Season to taste with salt and pepper. Transfer mixture to prepared dish. Dot with butter. (Can be prepared 1 day ahead. Cool slightly. Cover with foil and refrigerate. Before continuing, heat covered gratin in 400*F oven until warm but not hot, about 20 minutes.)', 'Preheat oven to 400*F. Mix breadcrumbs, cheese, and melted butter in bowl until crumbs are coated with butter. Sprinkle crumbs evenly over gratin. Bake until vegetables are heated through and crumbs are crisp and golden, about 35 minutes.']",
    "ingredients": "['2 1/2 tablespoons butter', '2 1/2 tablespoons all purpose flour', '1 1/2 cups whole milk, hot', '3/4 cup (packed) coarsely grated extra-sharp white cheddar cheese', '1/4 teaspoon hot pepper sauce', '2 tablespoons olive oil, divided', '1 pound medium-size yellow crookneck squash, trimmed, cut into 1/2-inch-thick rounds', '1 pound medium-size zucchini, trimmed, cut into 1/2-inch-thick rounds', '1 1/4 cups diced onion', '1 cup diced red bell pepper', '1 garlic clove, minced', '1 cup frozen corn kernels, thawed', '1 teaspoon chopped fresh rosemary', '1 tablespoon butter, cut into 1/2-inch cubes', '1 1/2 cups (packed) fresh breadcrumbs made from crusty French bread (do not remove crust)', '1/2 cup (packed) coarsely grated extra-sharp white cheddar cheese (about 2 ounces)', '1 1/2 tablespoons butter, melted']",
    "calories": 337,
    "category": "V"
  },
  {
    "title":"Warm Milk Chocolate Souffles with Vanilla Ice Cream",
    "directions": "['Position rack in center of oven and preheat to 350*F. Butter eight 3/4-cup souffle dishes. Coat souffle dishes with sugar. Arrange souffle dishes on heavy large baking sheet. Stir milk chocolate and butter in medium metal bowl set over saucepan of simmering water until chocolate mixture is melted and smooth (do not allow bottom of bowl to touch water). Cool chocolate mixture to lukewarm.', 'Using electric mixer, beat egg yolks, whole eggs, and sugar in large bowl until pale, thick, and tripled in volume, about 6 minutes. Fold 1/3 of egg mixture into lukewarm chocolate mixture to lighten. Gently fold chocolate mixture into remaining egg mixture. Spoon into prepared dishes, dividing equally. Smooth tops.', 'Bake until souffles rise and edges are crisp and dark brown but centers are still soft, about 25 minutes. Dust tops with powdered sugar. Transfer to plates. Serve immediately, passing ice cream separately.']",
    "ingredients": "['14 ounces good-quality milk chocolate (such as Lindt or Ghirardelli), chopped', '3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into small cubes', '6 large egg yolks', '2 large eggs', '1/3 cup sugar', 'Powdered sugar (for dusting)', 'Vanilla ice cream']",
    "calories": 514,
    "category": "D"
  },
  {
    "title": "Spiced Honey Cake With Cream Cheese Frosting",
    "directions": "['Preheat oven to 350*F. Coat a 9\" cake pan with nonstick spray and line bottom with a parchment paper round. Whisk flour, baking powder, baking soda, salt, cinnamon, ginger, and nutmeg in a large bowl to combine.', 'Combine granulated sugar, brown sugar, oil, honey, egg, and egg yolk in another large bowl. Scrape in seeds from vanilla bean; discard pod. Using an electric mixer on medium speed, beat mixture until pale and thickened, about 4 minutes. Reduce speed to medium-low and gradually pour in orange juice and whey. Beat until frothy, about 2 minutes. Reduce speed to low and gradually add dry ingredients; beat just until smooth and homogenous (it will be thin, like pancake batter).', 'Pour into prepared pan and bake until cake is golden brown and center springs back when gently pressed (a cake tester will not come out clean), 45%u201355 minutes. Transfer to a wire rack and let cool in pan, 20 minutes. Run a knife around edges of cake to loosen and invert onto rack; let cool completely.', 'Cake can be baked 3 days ahead. Store tightly wrapped at room temperature.', 'Using an electric mixer on medium-high speed, beat cream cheese and butter in a medium bowl until smooth. Add powdered sugar, lemon zest, and salt and scrape in seeds from vanilla bean; discard pod. Beat on low speed until mixture is very light and thickened, about 2 minutes; scrape down sides of bowl. With motor running, add coconut cream by the tablespoonful and beat until very soft peaks form (save coconut milk for another use).', \"Pile frosting on top of cake and spread to edges (it's okay if it cascades over the sides). Decorate with bee pollen, fennel fronds, flowers, and berries, if desired.\"]",
    "ingredients": "['Nonstick vegetable oil spray', '2 cups gluten-free all-purpose baking flour', '1 1/2 teaspoons baking powder', '1/2 teaspoon baking soda', '1/2 teaspoon kosher salt', '1 1/2 teaspoons ground cinnamon', '1/2 teaspoon ground ginger', '1/8 teaspoon freshly grated nutmeg', '2/3 cup granulated sugar', '1/4 cup (packed) light brown sugar', '1/2 cup vegetable oil', '1/2 cup honey', '1 large egg', '1 large egg yolk', '1/2 vanilla bean, split lengthwise', '1/2 cup fresh orange juice', '1/2 cup whey or buttermilk', '3 ounces cream cheese, room temperature', '3 tablespoons unsalted butter, room temperature', '1 cup powdered sugar', '1 teaspoon finely grated lemon zest', 'Pinch of kosher salt', '1/2 vanilla bean, split lengthwise', '1 (13.5-ounce) can unsweetened coconut milk, cream separated from milk, room temperature', 'Bee pollen, fennel fronds, edible flowers, and berries (for serving; optional)']",
    "calories": 639,
    "category": "D"
  },
  {
    "title": "Blueberry-Lemon Cake with Lemon Cream Cheese Frosting",
    "directions": "['Preheat oven to 350*F. Butter three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottom of pans with parchment paper; butter paper. Dust pans with flour. Sift cake flour, baking powder, and salt into medium bowl. Transfer 1 tablespoon flour mixture to large bowl. Add fresh blueberries and toss to coat. Set remaining flour mixture and blueberries aside.', 'Stir whole milk, vanilla extract, and grated lemon peel in small bowl. Using electric mixer, beat butter in another large bowl until light and creamy. Gradually add sugar, beating until mixture is light and fluffy. Beat in eggs 1 at a time. Beat in flour mixture alternately with milk mixture in 3 additions each, just until blended. Fold in blueberries. Divide batter equally among pans.', 'Bake cakes until tester inserted into center comes out clean, about 25 minutes. Cool cakes in pans on racks 10 minutes. Run knife around pan sides to loosen. Turn cakes out onto racks to cool completely. Peel off parchment paper.', 'Transfer 1 cake layer to platter. Spread 3/4 cup frosting over cake layer. Top with another cake layer; spread with 3/4 cup frosting. Top with third cake layer. Spread remaining frosting over top and sides of cake. (Cake can be prepared up to 1 day ahead of time. Cover with cake dome and refrigerate. Let stand 30 minutes at room temperature before continuing.) Garnish cake with lemon peel strips, if desired, and serve.']",
    "ingredients": "['2 cups plus 6 tablespoons cake flour', '2 teaspoons baking powder', '1 teaspoon salt', '3 cups fresh blueberries (about three 4.4-ounce packages)', '1 cup whole milk', '2 teaspoons vanilla extract', '1 teaspoon grated lemon peel', '1 cup (2 sticks) unsalted butter, room temperature', '1 1/2 cups sugar', '4 large eggs', 'Lemon Cream Cheese Frosting', 'Lemon peel strips (optional)']",
    "calories": 381,
    "category": "D"
  },
  {
    "title": "Szechuan Steak au Poivre with Port-Ginger Sauce",
    "directions": "['Finely chop all peppercorns in processor. Rub pepper mixture over both sides of each steak. (Can be prepared 4 hours ahead. Cover and refrigerate.)', 'Heat oil in heavy medium skillet over high heat. Season steaks with salt. Add to skillet and cook to desired doneness, about 2 minutes per side for medium-rare. Transfer steaks to plate; tent with foil. Add Port, shallots and ginger to same skillet; boil until liquid is reduced to thin syrup, stirring frequently, about 5 minutes. Strain sauce into bowl, pressing on solids and spoon. Return sauce to same skillet; boil until thick syrup forms, about 2 minutes. Whisk in butter; season with salt. Spoon sauce around steaks.']",
    "ingredients": "['1 1/2 tablespoons Szechuan peppercorns', '2 teaspoons drained green peppercorns in brine', '2 6-ounce beef tenderloin steaks', '1 teaspoon vegetable oil', '1 cup ruby Port', '1/4 cup minced shallots', '1 1/2 tablespoons finely chopped fresh ginger', '1 1/2 tablespoons butter']",
    "calories": 634,
    "category": "P"
  }
]